docs/condition_number.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-19 Sat 18:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#condition-number">1. Condition Number</a>
<ul>
<li><a href="#well-conditioned-vs.-ill-conditioned">1.1. Well-Conditioned vs. Ill-Conditioned</a></li>
</ul>
</li>
<li><a href="#references">2. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-condition-number" class="outline-2">
<h2 id="condition-number"><span class="section-number-2">1.</span> Condition Number</h2>
<div class="outline-text-2" id="text-condition-number">
<p>
In the field of numerical analysis, the condition number of a function
measures how much the output value of the function can change for a
small change in the input argument. This is used to measure how
sensitive a function is to changes or errors in the input, and how much
error in the output results from an error in the input.
</p>
</div>

<div id="outline-container-well-conditioned-vs.-ill-conditioned" class="outline-3">
<h3 id="well-conditioned-vs.-ill-conditioned"><span class="section-number-3">1.1.</span> Well-Conditioned vs. Ill-Conditioned</h3>
<div class="outline-text-3" id="text-well-conditioned-vs.-ill-conditioned">
<p>
A problem with a low condition number is said to be well-conditioned,
while a problem with a high condition number is said to be
ill-conditioned. In non-mathematical terms, an ill-conditioned problem
is one where, for a small change in the inputs (the independent
variables) there is a large change in the answer or dependent variable.
This means that the correct solution/answer to the equation becomes hard
to find. The condition number is a property of the problem. Paired with
the problem are any number of algorithms that can be used to solve the
problem, that is, to calculate the solution. Some algorithms have a
property called backward stability. In general, a backward stable
algorithm can be expected to accurately solve well-conditioned problems.
Numerical analysis textbooks give formulas for the condition numbers of
problems and identify known backward stable algorithms.
</p>
</div>
</div>
</div>

<div id="outline-container-references" class="outline-2">
<h2 id="references"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><i>1</i> <a href="https://en.wikipedia.org/wiki/Condition_number.md">Condition
Number Wiki</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2022-11-19 Sat 18:47</p>
</div>
</body>
</html>
